import React, {useState} from 'react';
import {
  View,
  Text,
  Button,
  Image,
  StyleSheet,
  ActivityIndicator,
  TextInput,
  ScrollView,
  Picker,
  Switch,
} from 'react-native';

class App extends React.Component {
  render() {
    // const [value, onChangeText] = React.useState('Useless Placeholder');
    // const [selectedValue, setSelectedValue] = useState("java");
    // const [isEnabled, setIsEnabled] = useState(false);
    // const toggleSwitch = () => setIsEnabled((previousState) => !previousState);
    return (
      // View
      <ScrollView>
        <View style={[styles.container, styles.horizontal]}>
          {/* Image */}
          <Image
            style={{width: 140, height: 100}}
            source={require('./src/assets/klaighrafi-bismillah-11.png')}
          />

          {/* text */}
          <Text style={styles.text}>القرأن الكريم</Text>

          {/* Switch */}
          <Switch style={styles.Switch} />

          {/* TextInput */}
          <Text style={styles.text3}>cari nomor ayat:</Text>
          <TextInput
            style={{
              height: 30,
              borderColor: 'gray',
              borderWidth: 2,
              width: 360,
              marginBottom: 10,
              backgroundColor: '#f1f1f1',
              borderRadius: 5,
            }}
            onChangeText={(text) => onChangeText(text)}
          />

          {/* Button */}
          <Button
            title="buttom"
            onPress={() => {
              alert('apakah anda sudah mencari ayat yang anda cari??');
            }}
          />

          {/* Picker */}
          <Picker
            style={{height: 50, width: 100, marginRight: 250}}
            onValueChange={(itemValue, itemIndex) =>
              setSelectedValue(itemValue)
            }>
            <Picker.Item label="Al-Qur'an" value="Al-Qur'an" />
            <Picker.Item label="Hadist" value="Hadist" />
          </Picker>

          {/* ActivityIndicator */}
          <ActivityIndicator />
          <ActivityIndicator size="large" />
          <ActivityIndicator size="small" color="#81b0ff" />

          {/* ScrollView */}
          <Text style={styles.text2}>
            قَدْ سَمِعَ اللَّـهُ قَوْلَ الَّتِى تُجٰدِلُكَ فِى زَوْجِهَا
            وَتَشْتَكِىٓ إِلَى اللَّـهِ وَاللَّـهُ يَسْمَعُ تَحَاوُرَكُمَآ ۚ
            إِنَّ اللَّـهَ سَمِيعٌۢ بَصِيرٌ ﴿المجادلة:١ الَّذِينَ يُظٰهِرُونَ
            مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهٰتِهِمْ ۖ إِنْ
            أُمَّهٰتُهُمْ إِلَّا الّٰٓـِٔى وَلَدْنَهُمْ ۚ وَإِنَّهُمْ
            لَيَقُولُونَ مُنكَرًا مِّنَ الْقَوْلِ وَزُورًا ۚ وَإِنَّ اللَّـهَ
            لَعَفُوٌّ غَفُورٌ ﴿المجادلة:٢ وَالَّذِينَ يُظٰهِرُونَ مِن
            نِّسَآئِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا۟ فَتَحْرِيرُ رَقَبَةٍ
            مِّن قَبْلِ أَن يَتَمَآسَّا ۚ ذٰلِكُمْ تُوعَظُونَ بِهِۦ ۚ وَاللَّـهُ
            بِمَا تَعْمَلُونَ خَبِيرٌ ﴿المجادلة:٣ فَمَن لَّمْ يَجِدْ فَصِيَامُ
            شَهْرَيْنِ مُتَتَابِعَيْنِ مِن قَبْلِ أَن يَتَمَآسَّا ۖ فَمَن لَّمْ
            يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا ۚ ذٰلِكَ لِتُؤْمِنُوا۟
            بِاللَّـهِ وَرَسُولِهِۦ ۚ وَتِلْكَ حُدُودُ اللَّـهِ ۗ
            وَلِلْكٰفِرِينَ عَذَابٌ أَلِيمٌ ﴿المجادلة:٤ إِنَّ الَّذِينَ
            يُحَآدُّونَ اللَّـهَ وَرَسُولَهُۥ كُبِتُوا۟ كَمَا كُبِتَ الَّذِينَ
            مِن قَبْلِهِمْ ۚ وَقَدْ أَنزَلْنَآ ءَايٰتٍۭ بَيِّنٰتٍ ۚ
            وَلِلْكٰفِرِينَ عَذَابٌ مُّهِينٌ ﴿المجادلة:٥ يَوْمَ يَبْعَثُهُمُ
            اللَّـهُ جَمِيعًا فَيُنَبِّئُهُم بِمَا عَمِلُوٓا۟ ۚ أَحْصَىٰهُ
            اللَّـهُ وَنَسُوهُ ۚ وَاللَّـهُ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ
            ﴿المجادلة:٦ أَلَمْ تَرَ أَنَّ اللَّـهَ يَعْلَمُ مَا فِى السَّمٰوٰتِ
            وَمَا فِى الْأَرْضِ ۖ مَا يَكُونُ مِن نَّجْوَىٰ ثَلٰثَةٍ إِلَّا هُوَ
            رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَآ أَدْنَىٰ
            مِن ذٰلِكَ وَلَآ أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا۟ ۖ
            ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُوا۟ يَوْمَ الْقِيٰمَةِ ۚ إِنَّ
            اللَّـهَ بِكُلِّالمجادلة شَىْءٍ عَلِيمٌ ﴿المجادلة:٧ أَلَمْ تَرَ
            إِلَى الَّذِينَ نُهُوا۟ عَنِ النَّجْوَىٰ ثُمَّ يَعُودُونَ لِمَا
            نُهُوا۟ عَنْهُ وَيَتَنٰجَوْنَ بِالْإِثْمِ وَالْعُدْوٰنِ وَمَعْصِيَتِ
            الرَّسُولِ وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ
            اللَّـهُ وَيَقُولُونَ فِىٓ أَنفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللَّـهُ
            بِمَا نَقُولُ ۚ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا ۖ
            فَبِئْسَالمجادلةتُمْ فَلَا تَتَنٰجَوْا۟ بِالْإِثْمِ وَالْعُدْوٰنِ
            وَمَعْصِيَتِ الرَّسُولِ وَتَنٰجَوْا۟ بِالْبِرِّ وَالتَّقْوَىٰ ۖ
            وَاتَّقُوا۟ اللَّـهَ الَّذِىٓ إِلَيْهِ تُحْشَرُونَ ﴿المجادلة:٩
            إِنَّمَا النَّجْوَىٰ مِنَ الشَّيْطٰنِ لِيَحْزُنَ الَّذِينَ
            ءَامَنُوا۟ وَلَيْسَ بِضَآرِّهِمْ شَيْـًٔا إِلَّا بِإِذْنِ اللَّـهِ ۚ
            وَعَلَى اللَّـهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ﴿المجادلة:١۰
            يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِذَا قِيلَ لَكُمْ تَفَسَّحُوا۟
            فِى الْمَجٰلِسِ فَافْسَحُوا۟ يَفْسَحِ اللَّـهُ لَكُمْ ۖ وَإِذَا
            قِيلَ انشُزُوا۟ فَانشُزُوا۟ يَرْفَعِ اللَّـهُ الَّذِينَ ءَامَنُوا۟
            مِنكُمْ وَالَّذِينَ أُوتُوا۟ الْعِلْمَ دَرَجٰتٍ ۚ وَاللَّـهُ بِمَا
            تَعْمَلُونَ خَبِيرٌ ﴿المجادلة:١١ يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟
            إِذَا نٰجَيْتُمُ الرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ
            صَدَقَةً ۚ ذٰلِكَ خَيْرٌ لَّكُمْ وَأَطْهَرُ ۚ فَإِن لَّمْ تَجِدُوا۟
            فَإِنَّ اللَّـهَ غَفُورٌ رَّحِيمٌ ﴿المجادلة:١٢ ءَأَشْفَقْتُمْ أَن
            تُقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقٰتٍ ۚ فَإِذْ لَمْ
            تَفْعَلُوا۟ وَتَابَ اللَّـهُ عَلَيْكُمْ فَأَقِيمُوا۟ الصَّلَوٰةَ
            وَءَاتُوا۟ الزَّكَوٰةَ وَأَطِيعُوا۟ اللَّـهَ وَرَسُولَهُۥ ۚ
            وَاللَّـهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ ﴿المجادلة:١٣ أَلَمْ تَرَ إِلَى
            الَّذِينَ تَوَلَّوْا۟ قَوْمًا غَضِبَ اللَّـهُ عَلَيْهِم مَّا هُم
            مِّنكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ
            يَعْلَمُونَ ﴿المجادلة:١٤ أَعَدَّ اللَّـهُ لَهُمْ عَذَابًا شَدِيدًا ۖ
            إِنَّهُمْ سَآءَ مَا كَانُوا۟ يَعْمَلُونَ ﴿المجادلة:١٥ اتَّخَذُوٓا۟
            أَيْمٰنَهُمْ جُنَّةً فَصَدُّوا۟ عَن سَبِيلِ اللَّـهِ فَلَهُمْ
            عَذَابٌ مُّهِينٌ ﴿المجادلة:١٦ لَّن تُغْنِىَ عَنْهُمْ أَمْوٰلُهُمْ
            وَلَآ أَوْلٰدُهُم مِّنَ اللَّـهِ شَيْـًٔا ۚ أُو۟لٰٓئِكَ أَصْحٰبُ
            النَّارِ ۖ هُمْ فِيهَا خٰلِدُونَ ﴿المجادلة:١٧ يَوْمَ يَبْعَثُهُمُ
            اللَّـهُ جَمِيعًا فَيَحْلِفُونَ لَهُۥ كَمَا يَحْلِفُونَ لَكُمْ ۖ
            وَيَحْسَبُونَ أَنَّهُمْ عَلَىٰ شَىْءٍ ۚ أَلَآ إِنَّهُمْ هُمُ
            الْكٰذِبُونَ ﴿المجادلة:١٨ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطٰنُ
            فَأَنسَىٰهُمْ ذِكْرَ اللَّـهِ ۚ أُو۟لٰٓئِكَ حِزْبُالمجادلة
            الشَّيْطٰنِ ۚ أَلَآ إِنَّ حِزْبَ الشَّيْطٰنِ هُمُ الْخٰسِرُونَ
            ﴿المجادلة:١٩ إِنَّ الَّذِينَ يُحَآدُّونَ اللَّـهَ وَرَسُولَهُۥٓ
            أُو۟لٰٓئِكَ فِى الْأَذَلِّينَ ﴿المجادلة:٢۰ كَتَبَ اللَّـهُ
            لَأَغْلِبَنَّ أَنَا۠ وَرُسُلِىٓ ۚ إِنَّ اللَّـهَ قَوِىٌّ عَزِيزٌ
            ﴿المجادلة:٢١ لَّا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّـهِ وَالْيَوْمِ
            الْءَاخِرِ يُوَآدُّونَ مَنْ حَآدَّ اللَّـهَ وَرَسُولَهُۥ وَلَوْ
            كَانُوٓا۟ ءَابَآءَهُمْ أَوْ أَبْنَآءَهُمْ أَوْ إِخْوٰنَهُمْ أَوْ
            عَشِيرَتَهُمْ ۚ أُو۟لٰٓئِكَ كَتَبَ فِى قُلُوبِهِمُ الْإِيمٰنَ
            وَأَيَّدَهُم بِرُوحٍ مِّنْهُ ۖ وَيُدْخِلُهُمْ جَنّٰتٍ تَجْرِى مِن
            تَحْتِهَا الْأَنْهٰرُ خٰلِدِينَ فِيهَا ۚ رَضِىَ اللَّـهُ عَنْهُمْ
            وَرَضُوا۟ عَنْهُ ۚ أُو۟لٰٓئِكَ حِزْبُ اللَّـهِ ۚ أَلَآ إِنَّ حِزْبَ
            اللَّـهِ هُمُ الْمُفْلِحُونَ ﴿المجادلة:٢٢
          </Text>
        </View>
      </ScrollView>
    );
  }
}

export default App;

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: '#f1f1f1',
    alignItems: 'center',
    justifyContent: 'center',
  },
  Switch: {
    marginLeft: 270,
    // trackColor= {false: "#767577", true: "#81b0ff"}
  },
  text: {
    fontSize: 40,
  },
  text2: {
    fontSize: 25,
    marginTop: 50,
  },
  text3: {
    marginRight: 250,
    fontSize: 15,
    marginTop: 20,
    marginBottom: 7,
  },
});

// cara ke-2 membuat aplikasi dari react-Native

// import React from 'react'
// import {View, Text} from 'react-native'

// const App =()=>{
//   return(
//     <View>
//       <Text>Kumpulan Hadist sesuai sunnah</Text>
//     </View>
//   )
// }

// export default App
